Repository: Kostenkov-2021/openLinkWith
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, fr, ru, tr, zh_cn

source: Link has no apparent destination
ru: Ссылка не имеет адресата

source: Not a link.
ar: ليس بِرابط.
ru: Это не ссылка.
tr: Bağlantı değil.
zh_cn: 不是链接。

source: Open link with menu
ru: Меню дополнения
tr: Bağlantıyı şununla aç menüsü
zh_cn: 打开链接菜单

source: Error in opening the link with {item} browser
ar: حدَثَ خَطأ عند فتح الرابط بالمتصفح {item}.
ru: Ошибка при открытии ссылки в браузере {item}
tr: {item} tarayıcısıyla bağlantıyı açarken hata oluştu
zh_cn: 使用 {item} 浏览器打开链接时出错

source: Error Message
ar: رسالةْ خَطأ
ru: Сообщение об ошибке
tr: Hata mesajı
zh_cn: 错误信息

source: Open Link With
ar: فتح الروابط
fr: Ouvrir le Lien Avec
ru: Открыть ссылку с помощью
tr: Bağlantıyı Şununla Aç
zh_cn: 打开链接

source: OpenLinkWith...
ar: فتح الروابط...
fr: Ouvrir le Lien Avec...
ru: Открыть ссылку с помощью...
tr: &BağlantıyıŞununlaAç...
zh_cn: 打开链接

source: Display Open Link With dialog with extracted links from selected text.
ar: إظهار محاورة فتح الروابط بالروابط الموجودة في النص المحدد.
fr: Afficher la boîte de dialogue ouvrir les liens Avec les liens extraits.
ru: Показать диалог с извлечёнными ссылками из выделенного текста.
tr: Seçili metinden ayıklanmış bağlantıları içeren, Bağlantıyı Şununla Aç iletişim kutusunu gösterir.
zh_cn: 从选中文本中提取链接

source: another instance of the dialog is openned, close it please
ar: هناك محاورة أخرى مفتوحة, اغلِقْها فضلا
fr: une autre boîte de dialogue est déjà ouverte, fermez-la s'il vous plaît
ru: открыт ещё один экземпляр диалогового окна. Пожалуйста, закройте его
tr: iletişim kutusunun başka bir örneği zaten açık, lütfen kapatın
zh_cn: 另一个对话框已打开，请先关闭。

source: Display Open Link With dialog with extracted links from clipboard.
ar: إظهار محاورة فتح الروابط بالروابط الموجودة في الحافِظة.
fr: Afficher la boîte de dialogue Ouvrir le lien avec les liens extraits du presse-papiers.
ru: Показать диалог с извлечёнными ссылками из буфера обмена .
tr: Panodaki metinden ayıklanmış bağlantıları içeren, Bağlantıyı Şununla Aç iletişim kutusunu gösterir.
zh_cn: 从剪贴板文本中提取链接

source: Display Open Link With dialog with extracted links from last spoken text.
ar: إظهار محاورة فتح الروابط بالروابط الموجودة في آخِر نص منطوق.
ru: Показать диалог с извлечёнными ссылками из последнего произнесённого текста.
tr: Son söylenen metinden ayıklanmış bağlantıları içeren, Bağlantıyı Şununla Aç iletişim kutusunu gösterir.
zh_cn: 从最后一次朗读的文本中提取链接

source: Display a menu, if standing on a hyper link to give you the option to open the link with other browsers on your machine.
ar: إظهار قائمة, إذا كنت تقف على رابط, لإعطائك إمكانيةْ فتح الرابط بمتصفحات أخرى على حاسوبك.
ru: Показать меню при нахождении на гиперссылке, чтобы дать вам возможность открыть ссылку с помощью других браузеров на вашем компьютере.
tr: Bir köprü üzerindeyken, bağlantıyı bilgisayardaki diğer tarayıcılarla açma seçeneği sunmak için bir menü görüntüler.
zh_cn: 显示一个菜单，如果输入焦点位于超链接上，可以选择用已安装的其他浏览器打开链接。

source: The link {linkValue} is not suitable to open with the browser
ar: الرابط ذو القيمة {linkValue} ليس مِن المناسب فتحه بالمتصفح.
ru: Ссылка {linkValue} не подходит для открытия в браузере
tr: {linkValue} bağlantısı tarayıcıyla açılmaya uygun değil
zh_cn: 链接 {linkValue} 不适合用浏览器打开

source: Information
ar: تعليمات
ru: Информация
tr: Bilgi
zh_cn: 信息

source: Open link with
ar: فتح الروابط
fr: Ouvrir le Lien Avec
ru: Открыть ссылку с помощью
tr: Bağlantıyı şununla aç
zh_cn: 打开链接

source: Close openLinkWith Dialog after activating a link
ar: إغلاق محاورة فتح الروابط بعد تفعيل أحد الروابط
fr: Fermer la boîte de dialogue Ouvrir le Lien après avoir activé un lien
ru: Закрыть диалог после активации ссылки
tr: Bir bağlantıyı etkinleştirdikten sonra BağlantıyıŞununlaAç iletişim kutusunu kapat
zh_cn: 打开链接后关闭对话框

source: If only one link, open directly with default browser
ar: إذا كان رابط واحد فقط, فقم فتحه بالمتصفح الإفتراضي فورا
ru: Если ссылка только одна, открыть её непосредственно в браузере по умолчанию
tr: Eğer tek bir bağlantı varsa, varsayılan tarayıcı ile aç
zh_cn: 若只有一个链接则直接用默认浏览器打开

source: No text selected
ar: لا يوجد نص محدد
fr: Aucun texte sélectionné
ru: Текст не выделен
tr: Seçili Metin Yok
zh_cn: 未选择文本

source: no links in selected text
ar: لا توجد روابط في النص المحدد
fr: aucun lien dans le texte sélectionné
ru: нет ссылок в выделенном тексте
tr: seçili metinde bağlantı yok
zh_cn: 所选文本中没有链接

source: No text in clipboard.
ar: ليس هناك نص في الحافِظة.
fr: Aucun texte dans le presse-papiers.
ru: Нет текста в буфере обмена.
tr: Panoda metin yok.
zh_cn: 剪贴板中没有文本

source: No links in clipboard text.
ar: ليس هناك روابط في النص الموجود في الحافِظة
fr: il n'y a pas de lien dans le texte du presse-papiers.
ru: Нет ссылок в тексте из буфера обмена.
tr: Panodaki metinde bağlantı yok.
zh_cn: 剪贴板文本中没有链接

source: No text.
ar: ليس هناك نص
ru: Нет текста.
tr: Metin yok.
zh_cn: 没有文本

source: No links in last spoken text.
ru: Нет ссылок в последнем произнесённом тексте.
tr: Son konuşulan metinde bağlantı yok.
zh_cn: 最后一次朗读的文本中没有链接

source: Open With
ar: افتح بالمتصفح
fr: Ouvrez Avec
ru: Открыть ссылку с помощью
tr: Şununla Aç
zh_cn: 打开链接

source: Extract links if found in selected, last spoken or clipboard text, display them in a list in a dialog, giving you the option to open any link with various browsers found on computer. Press the command you assotiated with the addon via input gestures, to display OpenLinkWith dialog.
ru: Это дополнение извлекает ссылки, найденные в выделенном тексте, последнем произнесённом тексте или тексте из буфера обмена, отображает их в виде списка в диалоге, предоставляя возможность открыть любую ссылку с помощью различных браузеров, имеющихся на компьютере. Нажмите команду, которую вы назначили в диалоге жесты ввода, чтобы показать диалог дополнения.
zh_cn: 该插件可以从选中的文本、剪贴板中的文本或最后一次朗读的文本中提取所包含的链接，并显示在一个弹出对话框的列表内， 您可以选择使用已安装的浏览器打开列表中的链接。

source: Extract links if found in selected textor clipboard, display them in a list in a dialog, giving you the option to open any link with various browsers found on computer. Press the command you assotiated with the addon via input gestures, to display OpenLinkWith dialog.
fr: Cette extention extrait les liens sélectionnés du texte ou du presse-papiers, et affiche la liste des liens dans une boîte de dialogue. Vous pouvez ensuite activer n'importe lequel d'entre eux dans un navigateur installé sur votre ordinateur. Il est possible aussi de créer un raccourci pour ouvrir la boîte de dialogue, dans le menu NVDA, puis préférences sous-menu, puis Gestes de commandes dans la catégorie Ouvrir le Lien Avec.
